* Emacs Workflows

  I'm going to figure out some good workflows because arduino-ide just sucks in all ways.

  What would be nice is if I could deploy blocks from org directly to an attached arduino

  Maybe something like

  #+begin_src arduino :board leonardo :port /dev/sty0
  #+end_src

  I just attached the board

  #+begin_src shell
    arduino-cli board list
  #+end_src

  #+RESULTS:
  | Port         | Type   | Board | Name  | FQBN    | Core     |                      |             |
  | /dev/ttyACM0 | Serial | Port  | (USB) | Arduino | Leonardo | arduino:avr:leonardo | arduino:avr |
  |              |        |       |       |         |          |                      |             |

  Well lets set up a setch - there's something about the directorory structure that's important

  #+begin_src shell
    arduino-cli sketch new blinky-blink
  #+end_src

  Lets also set up tangle-on-save
  
   #+begin_src emacs-lisp :results none
     (add-hook 'after-save-hook 'org-babel-tangle)
   #+end_src

** Blinky Blink
   :PROPERTIES:
   :header-args:shell: :dir ./blinky-blink
   :END:

    #+RESULTS:
    : Sketch created in: /home/gmauer/code/arduino-playground/blinky-blink

    #+begin_src shell
      ls -l blinky-blink
    #+end_src

    #+RESULTS:
    | total      | 1 |        |        |    |     |    |       |                  |
    | -rwx------ | 1 | gmauer | gmauer | 35 | Aug | 18 | 21:51 | blinky-blink.ino |
    
   Lets write something we can tangle that will do some bliking

   #+begin_src arduino :tangle ./blinky-blink/blinky-blink.ino
     const int LIGHT_BLINKING_PIN
     
     int counter = 0;
     
     
     void setup()
     {
       Serial.begin(9600);
       pinMode(LIGHT_BLINKING_PIN, OUTPUT);
     }
     
     void loop()
     {
       counter = counter + 1;
     
       Serial.println(counter);
     
       digitalWrite(LIGHT_BLINKING_PIN, HIGH);
       delay(200);
       digitalWrite(LIGHT_BLINKING_PIN, LOW);
       delay(400);
       digitalWrite(LIGHT_BLINKING_PIN, HIGH);
       delay(400);
       digitalWrite(LIGHT_BLINKING_PIN, LOW);
       delay(200);
     }
   #+end_src

   I can compile it like this

   #+begin_src shell :results code :dir .
     arduino-cli compile -b arduino:avr:leonardo blinky-blink
   #+end_src

   #+RESULTS:
   #+begin_src shell
   Sketch uses 4294 bytes (14%) of program storage space. Maximum is 28672 bytes.
   Global variables use 153 bytes (5%) of dynamic memory, leaving 2407 bytes for local variables. Maximum is 2560 bytes.
   #+end_src

   And it looks like that generates some me files

   #+begin_src shell
     ls -l
   #+end_src

   #+RESULTS:
   | total      | 85 |        |        |       |     |    |       |                                                       |
   | -rwx------ |  1 | gmauer | gmauer | 49000 | Aug | 18 | 22:44 | blinky-blink.arduino.avr.leonardo.elf                 |
   | -rwx------ |  1 | gmauer | gmauer | 12098 | Aug | 18 | 22:44 | blinky-blink.arduino.avr.leonardo.hex                 |
   | -rwx------ |  1 | gmauer | gmauer | 21468 | Aug | 18 | 22:44 | blinky-blink.arduino.avr.leonardo.with_bootloader.hex |
   | -rwx------ |  1 | gmauer | gmauer |   310 | Aug | 18 | 22:04 | blinky-blink.ino                                      |


   So lets try to upload? Here's the port

   #+begin_src shell
     ls /dev | grep ACM
   #+end_src

   #+RESULTS:
   : ttyACM0

   #+begin_src shell :dir .
     arduino-cli upload blinky-blink -b arduino:avr:leonardo -p /dev/ttyACM0
   #+end_src

   #+RESULTS:

   And that works!

 
** Playground
   
    #+begin_src emacs-lisp :dir /tmp/playground
      (make-directory "/tmp/template-test" 't)
      (async-shell-command "arduino-cli sketch new template-test")
    #+end_src

    #+RESULTS:
    : #<window 291 on *Async Shell Command*>
  
   Can we do templates?
   
   #+begin_src arduino :tangle /tmp/playground/template-test/template-test.ino
     // To handle base case of below recursive
     // Variadic function Template
     void print() {
     }
     
     // Variadic function Template that takes
     // variable number of arguments and prints
     // all of them.
     template <typename T, typename... Types>
       void print(T var1, Types... var2) {
     
       print(var2...);
     }
     
     void setup() {
       print(1, 2, 3.14,
             "Pass me any "
             "number of arguments",
             "I will print\n");
     
     }
     void loop() {
     }
   #+end_src

   #+begin_src emacs-lisp :dir /tmp/playground :results silent
     (with-help-window "*Playground Build*"
       (async-shell-command "arduino-cli compile -b arduino:avr:leonardo template-test" "*Playground Build*"))
   #+end_src
